{
  "title": "Mis Proyectos",
  "subtitle": "Aquí hay algunos de los proyectos en los que he trabajado recientemente. Cada uno representa un desafío único y una experiencia de aprendizaje.",
  "status": {
    "completed": "Completado",
    "inProgress": "En Progreso",
    "planned": "Planificado"
  },
  "buttons": {
    "viewLive": "Ver Demo",
    "viewCode": "Ver Código",
    "learnMore": "Saber Más"
  },
  "projects": {
    "ecommerce-platform": {
      "title": "Plataforma E-commerce Moderna",
      "description": "Solución de comercio electrónico full-stack con características avanzadas como inventario en tiempo real, procesamiento de pagos y panel de administración.",
      "longDescription": "Una plataforma de comercio electrónico integral construida con React y Node.js, que incluye autenticación de usuarios, gestión de productos, funcionalidad de carrito de compras, integración de pagos con Stripe, y un panel de administración completo para gestionar pedidos e inventario."
    },
    "task-management-app": {
      "title": "Gestor de Tareas Colaborativo",
      "description": "Aplicación de gestión de tareas en tiempo real con características de colaboración en equipo, interfaz de arrastrar y soltar, y seguimiento de progreso.",
      "longDescription": "Una potente aplicación de gestión de tareas que permite a los equipos colaborar efectivamente con características como actualizaciones en tiempo real, organización de tareas por arrastrar y soltar, seguimiento de tiempo, adjuntos de archivos, y analíticas completas del proyecto."
    },
    "weather-dashboard": {
      "title": "Dashboard de Análisis Meteorológico",
      "description": "Dashboard meteorológico interactivo con visualización de datos, pronósticos basados en ubicación y análisis meteorológico histórico.",
      "longDescription": "Un dashboard meteorológico avanzado que proporciona análisis meteorológicos detallados con gráficos interactivos, soporte multi-ubicación, alertas meteorológicas, y visualización de datos históricos usando bibliotecas de gráficos modernas."
    },
    "social-media-app": {
      "title": "Plataforma de Redes Sociales",
      "description": "Aplicación de redes sociales completa con mensajería en tiempo real, intercambio de contenido e interacciones sociales.",
      "longDescription": "Una plataforma de redes sociales moderna que incluye perfiles de usuario, chat en tiempo real, compartir publicaciones, likes y comentarios, características de historias, y controles de privacidad avanzados construidos con tecnologías web modernas."
    },
    "portfolio-generator": {
      "title": "Herramienta Generadora de Portafolios",
      "description": "Aplicación SaaS que ayuda a desarrolladores a crear portafolios profesionales con temas y plantillas personalizables.",
      "longDescription": "Una herramienta completa de generación de portafolios que permite a los desarrolladores crear portafolios profesionales conectando su GitHub, eligiendo entre múltiples temas, y personalizando diseños sin conocimiento de programación."
    },
    "mobile-fitness-app": {
      "title": "App Móvil de Seguimiento Fitness",
      "description": "Aplicación móvil React Native para seguimiento de fitness con planes de entrenamiento, monitoreo de progreso y características sociales.",
      "longDescription": "Una aplicación móvil completa de seguimiento de fitness construida con React Native, que incluye creación de entrenamientos personalizados, seguimiento de progreso, desafíos sociales, registro nutricional, e integración con dispositivos fitness populares."
    }
  }
}